cache/posts/contrasts-and-multiple-testing.html
<br>
<br>

<p>
So far in the <i>ANOVA</i> series we have encountered a simple one-way
analysis of variance test. This was based on the idea of comparing the
standardized sum of squares of the treatment effect and the one of the
stochastic component. We did this with the <i>omnibus</i> F-test testing
the null of no-effect of the treatments.
</p>

<p>
What happens however when we have a rather specific question, such as
the when we are concerned about the effect of a specific
treatment/factor and we question whether this is significant?
</p>

<!-- TEASER_END -->

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Setting up Hypothesis</h2>
<div class="outline-text-2" id="text-1">
<p>
In order to address our specific question we must set up an
hypothesis. In this sense, we can formulate a vector containing our
hypothesis.
</p>

<p>
For instance assuming a dataset containing a factor with three levels
such as the one encountered in the previous post. We might be
interested in comparing the mean of two of the levels of the factor.
We might then set up the hypothesis
</p>

\begin{align*}
  \vec{c} = \begin{pmatrix} 1 \\ -1 \\ 0\end{pmatrix} ; & \hspace{10mm} \vec{\alpha} = \begin{pmatrix} \alpha_1 \\ \alpha_2 \\ \alpha_3 \end{pmatrix} \\ 

  \\

  H_0: \vec{c}^\intercal * \vec{\alpha} &= 0  \\

  H_A: \vec{c}^\intercal * \vec{\alpha} &\neq 0 
\end{align*}

<br>

<p>
In the above case, we expressed the Null of equal treatment effects
for the two first levels. In an analogous way we can formulate any
other linear hypothesis.
</p>

<p>
Notice that the above is called a contrast and we usually provide a
side-constraint such that we ensure that the contrast above is testing
the difference among the treatments rather than the overall level of
the response. 
</p>

<p>
$$\sum^{m}_{i=1} c_i = 0$$
</p>

<p>
Notice however that if we are interested in the testing the difference
in levels of the treatment groups a Null as:
</p>

<p>
$$\vec{c} = \begin{pmatrix} 1 \\ 2 \\ 0 \end{pmatrix}$$
</p>

<p>
might make completely sense.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Analysis of Variance and F-tests</h2>
</div>
